erpdev.СХК_Расширение/src/Documents/СХК_Перемещение/СХК_Перемещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СХК_Перемещение</name>
  <registerRecords>AccumulationRegister.СХК_ТоварыНаСкладе</registerRecords>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекЯчейка</name>
      <type>
        <types>CatalogRef.СХК_СкладЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>НЯчейка</name>
      <type>
        <types>CatalogRef.СХК_СкладЯчейки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Время</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erpdev.СХК_Расширение/src/Documents/СХК_Перемещение/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	//@skip-check undefined-variable
	ЭтотОбъект.Автор = Пользователи.АвторизованныйПользователь().Ссылка;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим) 
	
	Попытка
		Движения.СХК_ТоварыНаСкладе.Записывать = Истина;
		Для Каждого ТекСтрокаТЧТовары Из ТЧТовары Цикл
			Движение = Движения.СХК_ТоварыНаСкладе.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТЧТовары.Номенклатура;
			Движение.Серия = ТекСтрокаТЧТовары.Серия;
			Движение.Ячейка = ТекСтрокаТЧТовары.ТекЯчейка;
			Движение.ВНаличии = ТекСтрокаТЧТовары.Количество;
		КонецЦикла;
	Исключение  
		Сообщить("Не Списано");
	КонецПопытки;
	
	// регистр СХК_ТоварыНаСкладе Приход
	Попытка
		Движения.СХК_ТоварыНаСкладе.Записывать = Истина;
		Для Каждого ТекСтрокаТЧТовары Из ТЧТовары Цикл
			Движение = Движения.СХК_ТоварыНаСкладе.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Номенклатура = ТекСтрокаТЧТовары.Номенклатура;
			Движение.Серия = ТекСтрокаТЧТовары.Серия;
			Движение.Ячейка = ТекСтрокаТЧТовары.НЯчейка;
			Движение.ВНаличии = ТекСтрокаТЧТовары.Количество;
		КонецЦикла;
	Исключение
		Сообщить("Не удалось выполнить перемещение");
	КонецПопытки;
	
	
	
КонецПроцедуры
